In [24]:
import pandas as pd
from sqlalchemy import create_engine

In [25]:
tgt_csv_file = "./TGT.csv"
tgt_data_df = pd.read_csv(tgt_csv_file)
tgt_data_df.head()

         date   volume       open      close       high        low   adjclose
0  2019-04-18  3162700  82.760002  83.260002  83.480003  82.440002  83.260002
1  2019-04-17  3045000  82.400002  82.680000  83.400002  82.300003  82.680000
2  2019-04-16  2663600  82.389999  81.970001  82.459999  81.650002  81.970001
3  2019-04-15  3306200  80.839996  81.980003  82.129997  80.690002  81.980003
4  2019-04-12  3517200  81.000000  80.730003  81.500000  80.440002  80.730003

In [12]:
tgt_data_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9858 entries, 0 to 9857
Data columns (total 7 columns):
date        9858 non-null object
volume      9858 non-null int64
open        9858 non-null float64
close       9858 non-null float64
high        9858 non-null float64
low         9858 non-null float64
adjclose    9858 non-null float64
dtypes: float64(5), int64(1), object(1)
memory usage: 539.2+ KB

In [23]:
tgt_by_price_df = tgt_data_df.loc[tgt_data_df['date'] == "2016-01-04"]
tgt_ey_price_df = tgt_data_df.loc[tgt_data_df['date'] == "2016-12-30"]
tgt_by_ey_price_df = tgt_by_price_df.append(tgt_ey_price_df)
tgt_by_ey_price_df

,date,volume,open,close,high,low,adjclose
828,2016-01-04,8233300,71.839996,73.550003,73.709999,71.529999,65.530708
577,2016-12-30,3069200,72.709999,72.230003,72.930000,71.879997,66.464729